Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.digitalocean_account.current: Reading...
data.digitalocean_account.current: Read complete after 0s [id=547d033c-39ff-4fb1-86f2-ae0bf48ab767]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_project.environment[0] will be created
  + resource "digitalocean_project" "environment" {
      + created_at  = (known after apply)
      + description = "A project to represent Development resources."
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = false
      + name        = "dev-shared-demo"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_status = "active"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @snegas, Action: `pull_request`, Workflow: `Shared Infra PR`*